[WOTCTrainerText]
Title="Trainer Panel"
PhaseNotice="Development preview. Save before testing; in-game acceptance is pending."
Tabs[0]="Resources"
Tabs[1]="Personnel"
Tabs[2]="Soldiers"
Tabs[3]="Strategy"
Tabs[4]="Items"
Tabs[5]="Tactical"
Tabs[6]="Mission"
Tabs[7]="Dangerous"
Resources[0]="Supplies"
Resources[1]="Intel"
Resources[2]="Alien Alloys"
Resources[3]="Elerium Crystals"
Resources[4]="Elerium Cores"
Resources[5]="XCOM Ability Points"
CurrentValue="Current value"
QuickAdd="Quick add (preview before applying)"
SetValue="Set value..."
Confirm="Confirm change"
Cancel="Cancel"
Close="Close"
Arrow=" → "
Engineers="Engineers"
Scientists="Scientists"
AddEngineer="+1 Engineer"
AddScientist="+1 Scientist"
PersonnelHelp="Create a new, unique staff member through the game's personnel generator. Identity, appearance, skill and HQ roster use the normal reward flow."
HealAll="Heal all soldiers"
HealingCount="Eligible healing projects"
HealingHelp="Complete normal healing projects for living, uncaptured soldiers in the HQ roster. Restores HP and clears wounds. The original game may also raise Will to the Ready threshold and resume paused Psi training. Dead/captured units and units without a legal healing project are excluded."
NothingToHeal="No eligible healing projects."
PendingPhase="Not implemented in this build."
Applied="Applied:"
Added="Added:"
CompletedCount="Completed before stopping:"
InvalidNumber="Enter an integer from 0 to 2147483647. Negative, decimal and overflowing values are rejected."
Unavailable="This action is only available in an active single-player strategy campaign."
Stale="The game state changed. Nothing new was applied; refresh and confirm again."
SubmitFailed="The game rejected the submission."
VerifyFailed="Post-submit verification did not match. Check the game and Launch.log before repeating this operation."
MissingResource="The resource entry is missing from HQ inventory. No change was submitted."
SaveReminder="This operation may change campaign state. Save beforehand."
InputTitle="Set a new total (0 to 2147483647)"
SoldierEditor="Barracks soldier editor"
Refresh="Refresh"
Barracks="Barracks"
RestoreDefault="Template default"
FullHeal="Full heal / clear wound"
RestoreWill="Restore Will / remove fatigue"
RemoveTraits="Remove negative traits"
RankAndClass="Rank / rookie class..."
SoldierFields[0]="HP"
SoldierFields[1]="Aim"
SoldierFields[2]="Mobility"
SoldierFields[3]="Will"
SoldierFields[4]="Hack"
SoldierFields[5]="Dodge"
SoldierFields[6]="Defense"
SoldierFields[7]="Personal AP"
SoldierFields[8]="XP"
SoldierHelp="Values are base stats. HP/Mobility/Will: 1-1000; other stats: 0-1000; AP: 0-100000. Template defaults exclude rank bonuses. Heal wounds and restore Will before changing their maximums. XP follows the game's cap; WOTC normally promotes by kills."
TemplateDefault="(character template, without rank bonuses)"
SpawnHelp="Click class/rank to cycle; click quantity to enter 1-20. Rookies have no class; named classes start at Squaddie. Faction soldiers require a contacted faction. High ranks use sequential promotions; choose advanced abilities in the normal Armory."
SpawnSoldier="Spawn soldier..."
Promote="Promote..."
Demote="Demote (disabled)"
UnsafeDemote="Demotion and changing an already-promoted soldier's class are disabled: the SDK debug reset does not reconcile spent WOTC AP and all persistent abilities. A rookie may choose one of the four standard classes during promotion."
Revive="Revive dead soldier (disabled)"
Unsafe="This feature is unsafe in this version and has been disabled."
ClassLabel="Class"
RankLabel="Rank"
CountLabel="Quantity"
LabelID="ID"
LabelTier="Tier"
RookieClass="Rookie promotion class:"
SelectSoldierFirst="Open a soldier in the soldier editor, then choose Rank / rookie class."
CountInput="Number of soldiers (1-20)"
Bounds="The value is outside this control's permitted range."
Unsupported="The current game templates do not support this operation safely."
FactionLocked="Contact this resistance faction before adding its soldiers."
UnitUnavailable="Read only: select a living, uncaptured HQ soldier who is Active or Healing and not on a covert action."
HealFirst="Complete this soldier's normal healing project before editing maximum HP."
WillFirst="Restore Will first so its recovery project remains synchronized."
XPCap="XP exceeds the current original-game promotion cap, or this rank has no safe AddXp path. Use sequential promotion instead."
NoWillProject="No legal Will recovery project exists for this soldier; no change was submitted."
TacticalHelp="Current mission only; XCOM soldiers only. Hit/Crit applies to StandardAim attacks. Healing does not clear status effects or post-mission wounds. Restore cooldowns counts abilities on cooldown. Ammo/No Reload share automatic refill behavior."
TacticalUnavailable="Available during an idle XCOM turn in single-player tactical combat; select a living XCOM soldier."
Teleport="Teleport (disabled)"
SelectedUnit="Selected:"
ActionPoints="Actions"
OnLabel="ON"
OffLabel="OFF"
TacticalToggles[0]="Squad God Mode"
TacticalToggles[1]="Selected soldier God Mode"
TacticalToggles[2]="Unlimited Actions"
TacticalToggles[3]="Unlimited Movement"
TacticalToggles[4]="Shooting Does Not End Turn"
TacticalToggles[5]="Unlimited Ammo"
TacticalToggles[6]="No Reload"
TacticalToggles[7]="No Ability Cooldown"
TacticalToggles[8]="Unlimited Ability / Item Charges"
TacticalToggles[9]="100% Hit Chance"
TacticalToggles[10]="100% Critical Chance"
TacticalToggles[11]="One Hit Kill"
TacticalActions[0]="Full heal"
TacticalActions[1]="+1 Action point"
TacticalActions[2]="+1 Movement action"
TacticalActions[3]="Reload primary weapon"
TacticalActions[4]="Reset cooldowns"
MissionControl="Mission control / diagnostics"
ObjectiveHelp="Left: actual mission records (internal IDs). Right: localized HUD objectives. The SDK does not expose a reliable mapping between these lists. Completing a record does not bypass each mission's scripted conditions."
MissionState="Rules state"
Enemies="Aliens"
Reinforcements="Pending reinforcement spawners"
InvalidTiles="Out-of-bounds tiles"
PendingSubmission="Latent submission in progress"
NoEnemiesHint="No living Alien/Lost units. Check unresolved Sweep objectives and pending reinforcements; this alone does not prove a mission bug."
RefreshObjectives="Refresh objective display"
CompleteSelected="Complete selected record..."
SkipAI="Skip current AI turn..."
RestartMission="Restart mission..."
MissionLimits="AI skip cannot interrupt an in-flight state submission. Same-seed restart and forced evacuation remain disabled until an auditable API exists."
InternalObjectives="Mission records (internal IDs)"
HUDObjectives="Localized HUD objective state"
IncompleteLabel="Incomplete"
CompletedLabel="Completed"
SkipAIHelp="Current enemy player: active turn → skip requested. Uses the normal SkipTurn state context. This may resolve some AI stalls, but not animation or latent-submission hangs."
RestartHelp="Current mission progress → original mission restart. Unsaved tactical progress is lost. Disabled for Ironman and tutorials. The same random seed is not guaranteed."
EndMissionHelp="Completing all records may affect strategy rewards. Victory uses normal EndBattle and first requires the mission's own success conditions. It does not rescue/copy units or fake campaign success. Failure also uses the normal end-game state."
CompleteAll="Complete all remaining records..."
EndVictory="End mission as victory..."
EndFailure="End mission as failure..."
SameSeed="Restart with same seed (disabled)"
EvacSquad="Force squad evacuation (disabled)"
ActiveMission="Mission in progress"
AIBusy="No AI-controlled UnitActions turn is currently available to skip. Wait for pending state submissions to finish."
CompleteFirst="The mission's original success conditions are not met. Inspect actual objectives, VIP/rescue and other scenario requirements first."
NoObjectives="No eligible incomplete objective was selected."
RepairAI="Disable AI planning..."
RestoreAI="Restore AI planning..."
AIHangHelp="Sets the AI players' skip flag, the same switch the original SkipAI console command and the SeqAct_SkipAI Kismet node use. A stalled AI player then finishes its turn through the engine's own end-turn path instead of being force-reset."
AIHangNote="Transient state: not saved, not part of game state. Objectives and units are not modified. Reloading the mission clears it."
AIHangScope="AI turn control"
RoleTactical="tactical"
RoleStrategy="strategy"
RoleTriad="triad"
RoleNone="This mission has no tactical or strategy objectives configured."
ObjectiveLoot="loot"
ObjectiveList="Objectives"
VictoryReady="Mission success conditions are satisfied; the campaign will record a success."
VictoryBlockedBy="Campaign success is not satisfied yet:"
TurnOwner="Active turn"
SweepNote="Vanilla rule: mission cleanup recovers dead soldiers' bodies and sweeps loot only when every tactical objective is complete. Completing the missing objectives first restores that resolution."
LootSweepBlocked="Sweep not resolved: bodies and loot will NOT be recovered."
SameSeedWhy="Disabled: the original RestartLevelWithSameSeed also calls XComCheatManager.SetSeedOverride, a native function with no readable implementation. Without that step a restart cannot be proven to reuse the same seed, so it is not offered."
TeamXCom="XCOM"
TeamAlien="Alien"
TeamLost="Lost"
TeamResistance="Resistance"
TeamNeutral="Neutral"
TeamOne="Team One"
TeamTwo="Team Two"
TeamOther="Other"
ItemHelp="Weapons, armor, ammo, upgrades and combat sims are enumerated live from the game's own item template manager, so everything the current game defines (DLC and installed mods included) appears here. Pick a row, set the amount and confirm to add it to the Avenger inventory."
ItemExcluded="Not listed:"
ItemExcludedWhy="templates that are resources, schematics, mission or story items, unlimited items, or carry no display name. Those are handled by the resource page or granted by campaign progress, so adding them here would duplicate or derail the campaign."
ItemsLabel="Items"
ItemAll="All categories"
ItemEmpty="Select an item to see its details."
QuantityLabel="Amount"
SetQuantity="Enter amount"
GrantItem="Add to inventory"
GrantHelp="This uses the same inventory path as an instant item build: no cost is charged and no build time is spent. The granted template is always the one selected here; the trainer does not substitute an upgraded version. Save before testing."
InternalName="Template"
CategoryLabel="Category"
SlotLabel="Slot"
OwnedLabel="In inventory"
UniqueNote="This item is always stored as a unique object, so one copy is added per confirmation."
NotGrantable="The trainer does not offer this template; see the notice text."
SlotUnknown="Unknown"
SlotArmor="Armor"
SlotPrimary="Primary weapon"
SlotSecondary="Secondary weapon"
SlotHeavy="Heavy weapon"
SlotUtility="Utility item"
SlotMission="Mission item"
SlotBackpack="Backpack"
SlotLoot="Loot"
SlotGrenade="Grenade"
SlotCombatSim="Combat sim"
SlotAmmo="Ammo"
SlotTertiary="Tertiary weapon"
SlotQuaternary="Quaternary weapon"
SlotQuinary="Quinary weapon"
SlotSenary="Senary weapon"
SlotSeptenary="Septenary weapon"
CatWeapon="Weapon"
CatArmor="Armor"
CatUpgrade="Weapon upgrade"
CatAmmo="Ammo item"
CatUtility="Utility item"
CatUnlimited="Unlimited"
CatCombatSim="Combat sim"
CatHeal="Healing item"
CatDefense="Defense item"
CatPsiDefense="Psi shield"
CatPsiOffense="Psi offense"
CatGrenade="Grenade"
CatTech="Tech item"
CatSkulljack="Skulljack"
CampaignTitle="Strategy operations"
CampaignHeaderAvatar="Avatar project"
CampaignAvatarPermanent="Core (irreversible)"
CampaignAvatarFacility="Alien facilities"
CampaignAvatarPending="Pending settlement"
CampaignAvatarTotal="Effective total"
CampaignAvatarMax="Limit"
CampaignMinus1="Avatar -1"
CampaignMinus2="Avatar -2"
CampaignMinus5="Avatar -5"
CampaignClear="Clear avatar progress"
CampaignAvatarHelp="Drains real strategy GameState Doom: largest alien facility first, then the irreversible core. The geoscape HUD reads these values live."
CampaignAvatarFromSites="facilities -"
CampaignAvatarFromPermanent="core -"
CampaignHeaderAbility="Avenger capacity"
CampaignPowerLabel="Avenger power (produced / consumed)"
CampaignContactLabel="Resistance contacts (used / max)"
CampaignBonus="Bonus"
CampaignHeaderQueue="Queued projects"
CampaignResearchLabel="Research"
CampaignProvingLabel="Proving Ground"
CampaignFacilityLabel="Facility construction"
CampaignCovertLabel="Covert actions"
CampaignResearchNow="Finish research now"
CampaignProvingNow="Finish Proving Ground now"
CampaignFacilityNow="Finish facility build now"
CampaignCovertNow="Finish covert actions now"
CampaignRefundNow="Refund build cost"
CampaignQueueHelp="These buttons run the vanilla project-completion routine."
CampaignNoProvingGround="Proving Ground buttons need that facility built with projects queued. Refunds pay the build cost back but do not cancel construction."
CampaignHeaderSquad="Squad recovery"
CampaignWounded="Wounded / healing"
CampaignResting="Needs will recovery"
CampaignHealAll="Heal all soldiers"
CampaignWillAll="Restore will / clear fatigue"
CampaignWillHelp="In WOTC fatigue is not a separate stored value: the game derives it from the current Will percentage, and Will below the maximum is what it reads as Tired. So restoring Will and clearing fatigue are the same write, and this is one combined action rather than two buttons. Soldiers already resting in the infirmary go through their own recover-will project so the staff slot and notification stay on the vanilla path."
CampaignNothingQueued="Nothing is queued for this action."
CampaignNothingToRemove="There is no avatar progress left to remove."
CampaignNothingToRestore="No soldier needs will recovery."
CampaignCompleted="completed:"
CampaignRefunded="refunded:"
CampaignCovertHelp="Uses the vanilla CompleteCovertAction routine, so the rewards, the completion popup, the resistance activity record and the rookie action refill all follow the original path. Unlike the vanilla timer, action risks are not resolved here, so soldiers on the assignment cannot be wounded or killed by it."
ItemSearch="Search"
ItemSearchAll="all items"
ItemStory="Show story items"
ItemStoryWarn="WARNING: story items are listed and selectable. Granting one can fire the acquisition effect the campaign expected to run at a story beat, and some of them cannot be taken back. Save before granting."
ItemExcludedWhyStory="templates that are resources, schematics, unlimited items, or carry no display name. Those stay hidden because granting them is a no-op or duplicates the resource page."
